---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarCurvesData.ClearAllAddedBarGeometry
source: html/9d7a1671-2d14-5dc7-b488-b597e8318e5d.htm
---
# Autodesk.Revit.DB.Structure.RebarCurvesData.ClearAllAddedBarGeometry Method

This function will remove all bars geometry that were added by calling AddBarGeometry().

## Syntax (C#)
```csharp
public void ClearAllAddedBarGeometry()
```